Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>libp2p</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_file.this["interop/.github/js_pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/js_pull_request_template.md [skip ci]"
      + commit_sha          = (known after apply)
      + content             = ".github/js_pull_request_template.md"
      + file                = ".github/js_pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "interop"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["js-libp2p-cms/.github/js_pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/js_pull_request_template.md [skip ci]"
      + commit_sha          = (known after apply)
      + content             = ".github/js_pull_request_template.md"
      + file                = ".github/js_pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-libp2p-cms"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["js-libp2p-daemon/.github/js_pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/js_pull_request_template.md [skip ci]"
      + commit_sha          = (known after apply)
      + content             = ".github/js_pull_request_template.md"
      + file                = ".github/js_pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-libp2p-daemon"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["js-libp2p-delegated-content-routing/.github/js_pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/js_pull_request_template.md [skip ci]"
      + commit_sha          = (known after apply)
      + content             = ".github/js_pull_request_template.md"
      + file                = ".github/js_pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-libp2p-delegated-content-routing"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["js-libp2p-delegated-peer-routing/.github/js_pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/js_pull_request_template.md [skip ci]"
      + commit_sha          = (known after apply)
      + content             = ".github/js_pull_request_template.md"
      + file                = ".github/js_pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-libp2p-delegated-peer-routing"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["js-libp2p-pubsub-peer-discovery/.github/js_pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/js_pull_request_template.md [skip ci]"
      + commit_sha          = (known after apply)
      + content             = ".github/js_pull_request_template.md"
      + file                = ".github/js_pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-libp2p-pubsub-peer-discovery"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["js-libp2p/.github/js_pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/js_pull_request_template.md [skip ci]"
      + commit_sha          = (known after apply)
      + content             = ".github/js_pull_request_template.md"
      + file                = ".github/js_pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "js-libp2p"
      + sha                 = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->